# Имя файла для Bash скрипта
ENV_SCRIPT = scripts/fill_env.sh

# ==================================================================================== #
# HELPERS
# ==================================================================================== #

## help: Вывод справки
.PHONY: help
help:
	@echo 'Usage:'
	@sed -n 's/^##//p' ${MAKEFILE_LIST} | column -t -s ':' | sed -e 's/^/ /'

# ==================================================================================== #
# ENVIRONMENTS
# ==================================================================================== #

## fill-env: Создание и заполнение .env файла
.PHONY: fill-env
fill-env:
	@echo "Запуск скрипта для заполнения .env файла..."
	./$(ENV_SCRIPT)

## clean-env: Удаление .env файла
.PHONY: clean-env
clean-env:
	@rm -f .env
